In [ ]:
===================================EDA========================
                              

1) pandas : Dataframe application 
    
2) Numpy : Numerical python All math application
    
3) Matplotlip : used for plotting 
    
4) Seaborn : used for plot
    
5) Plotly : used for plot 
    
6) Bokhe  : plot 
    
    
================================Machine learning===================

1) Sickit-Learn : sklearn
    

================================Deep Learning=======================


8) Tensorflow : Google 
    
    
9) Keras      : Google 
    

10) Pythorch   : Facebook
    
    
=====================================NLP ============================

11) NLKT  : Natural langague tool Kit 
    

12) Scipy 



==================================== BERT =============================

13) Transformers  : Hugging face (Google)
    
    
    
=====================================Google Models =====================

14) Specific google packages 


====================================== Azure ML==========================

15) Gemiani : Google 
    
17) ChatGpt : OPenAI
    
    
============================================= LangChain =====================

18) LangChain packages

**Create a DataFrame using List**

In [ ]:
- list ==== Dictionary 

- dictonary ===== list

$Step-1$

In [1]:
import pandas as pd 

names = [ 'Ayush', 'Avinash', 'Akash']

pd.DataFrame()                                # Empty dataframe no rows and nno colums

C:\Users\RUDRA JAWANE\AppData\Roaming\Python\Python311\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

Empty DataFrame
Columns: []
Index: []

$Step-2$

**Provied the data**

In [2]:
names = [ 'Ayush', 'Avinash', 'Akash']

pd.DataFrame(names)               # With rows or column

         0
0    Ayush
1  Avinash
2    Akash

In [9]:
age= [20,25,30]
age

[20, 25, 30]

In [11]:
pd.DataFrame(zip(name,age))
 
# What is the frist position Argument : data 
# Second position argument : index

         0   1
0    Ayush  20
1  Avinash  25
2    Akash  30

In [13]:
boys=['shubham','sandip','vivek']
roll_no=[18,19,20]
pd.DataFrame(zip(boys,roll_no))

         0   1
0  shubham  18
1   sandip  19
2    vivek  20

In [14]:
names = [ 'Ayush', 'Avinash', 'Akash']
age= [20,25,30]
city=['hyd','blr','chennai']
pd.DataFrame(zip(name,age,city))

         0   1        2
0    Ayush  20      hyd
1  Avinash  25      blr
2    Akash  30  chennai

$Step-3$

**Provied Cloumns names**

In [17]:
names = [ 'Ayush', 'Avinash', 'Akash']
age= [20,25,30]
pd.DataFrame(zip(name,age),
             columns=['Names','Age'])

     Names  Age
0    Ayush   20
1  Avinash   25
2    Akash   30

In [3]:
names = [ 'Ayush', 'Avinash', 'Akash']
age= [20,25,30]
city=['hyd','blr','chennai']

data=zip(names,age,city)
cols=['Names','Age','city']
df= pd.DataFrame(data,columns=cols)                 ## Stored a variable 
df

     Names  Age     city
0    Ayush   20      hyd
1  Avinash   25      blr
2    Akash   30  chennai

In [23]:
type(df)

pandas.core.frame.DataFrame

$Step-4$

**ADD new column**

- If you want to add new column 


- First you need to check the number of rows in already existed data

- For example in above the dataframe has 3 rows

- you need to create a new list with 3 rows

- that list equate to the data dataframe

- No of rows === to no of column

In [4]:
job= ['DS','DE','CS']
df['JOB']=job
df

     Names  Age     city JOB
0    Ayush   20      hyd  DS
1  Avinash   25      blr  DE
2    Akash   30  chennai  CS

$Step-5$

**Upadate the already Existed Columns**

- Create new column and update new column both are same way

In [28]:
df['Age']=[35,40,45]
df

     Names  Age     city JOB
0    Ayush   35      hyd  DS
1  Avinash   40      blr  DE
2    Akash   45  chennai  CB

$Step-6$

**How to change the index**

In [7]:
names = [ 'Ayush', 'Avinash', 'Akash','Anvi']
age= [20,25,30,40]
city=['hyd','blr','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names','Age','city']
idx=['A','B','C','D']
df= pd.DataFrame(data,
                 index=idx,
                 columns=cols)
df

     Names  Age     city
A    Ayush   20      hyd
B  Avinash   25      blr
C    Akash   30  chennai
D     Anvi   40   Mumbai

**Note**


- Number of list equal to **Number of columns**

- Number of values inside list equals to **Number of rows**

- When you create the data all the lists will be in same length

$Step-7$


**Shape**


- Number of rows 
`
- Number of columns

In [8]:
df.shape
#Matrix format

# 4 Rows and 3 columns 

print("the number of rows are:",df.shape[0])
print("the number of columns are:",df.shape[1])

the number of rows are: 4
the number of columns are: 3

$Step-8$

**Drop the column**

- In order to drop columns we required 3 arguments

- Columns name 

    - The column name we need to mention 
    
- axis 

   - axis =0 **represent  rows**
   
   
   - axis =1 **represent columns**
    
    
- inplace


   - we are drop column means we are modifiing the dataFrame 
    
    - so this modification we want to save variable or different variable 
    
    - if you want to keep in the same variable the **inplace = True**

In [38]:
df.drop('city',
       axis=1,
       inplace=True)

In [39]:
df

     Names  Age
A    Ayush   20
B  Avinash   25
C    Akash   30
D     Anvi   40

In [43]:
df1=df.drop('Age',
       axis=1)                 #### Not giving inpalce=True 
df1

     Names
A    Ayush
B  Avinash
C    Akash
D     Anvi

In [41]:
df                     ## 3rd column aslo given because inplace=True are given to df1

     Names  Age
A    Ayush   20
B  Avinash   25
C    Akash   30
D     Anvi   40

$Step-9$


**Multiple colums drop**

In [14]:
#Again read the data

import pandas as pd

names = [ 'Ayush', 'Avinash', 'Akash','Avni']
age= [20,25,30,40]
city=['hyd','blr','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']

df= pd.DataFrame(data,
                 index=idx,
                 columns=cols)
df

     Names  Age     City
A    Ayush   20      hyd
B  Avinash   25      blr
C    Akash   30  chennai
D     Avni   40   Mumbai

In [16]:
df.drop(['Age','City'],axis=1,inplace=True)

In [17]:
df

     Names
A    Ayush
B  Avinash
C    Akash
D     Avni

$Step-10$

**Drop the rows**

In [2]:
import pandas as pd

names = [ 'Ayush', 'Avinash', 'Akash','Avni']
age= [20,25,30,40]
city=['hyd','blr','chennai','Mumbai']

data=zip(names,age,city)
cols=['Names','Age','City']
idx=['A','B','C','D']

df= pd.DataFrame(data,
                 index=idx,
                 columns=cols)

C:\Users\RUDRA JAWANE\AppData\Roaming\Python\Python311\site-packages\pandas\core\arrays\masked.py:60: UserWarning: Pandas requires version '1.3.6' or newer of 'bottleneck' (version '1.3.5' currently installed).
  from pandas.core import (

In [22]:
df.drop('A',axis=0,inplace=True)

In [23]:
df

     Names  Age     City
B  Avinash   25      blr
C    Akash   30  chennai
D     Avni   40   Mumbai

$Step-11$

**How to save the data frame**
- Generally data frame are two types 

- csv(comma seperated value)

- excel

In [28]:
# files name = data 
# extension =.csv

df.to_csv('data.csv')

df.to_csv('data1.csv',index=False)              # if not required a index

In [4]:
# Extension 
# .xlsx

df.to_excel("data3.xlsx")